{
    "Levels": {
      "Level 1": {
        "Questions": [
            "What's your favorite ice-cream flavor?",
            "What's your go-to comfort food?",
            "Do you prefer tea or coffee?",
            "What's your favorite season?",
            "What's your favorite holiday destination?",
            "Do you enjoy cooking?",
            "What's your favorite movie genre?",
            "What's your favorite book?",
            "Do you prefer cats or dogs?",
            "What's your favorite color?",
            "What's your favorite hobby?",
            "Do you enjoy hiking?",
            "What's your favorite type of music?",
            "Do you have any siblings?",
            "What's your favorite childhood memory?",
            "Do you have a favorite sport?",
            "What's your favorite restaurant?",
            "Do you have any phobias?",
            "What's your favorite type of cuisine?",
            "What's your favorite TV show?",
            "Do you enjoy traveling?",
            "What's your favorite type of weather?",
            "Do you have a favorite artist?",
            "What's your favorite type of dessert?",
            "What's your favorite season for fashion?",
            "Do you have any tattoos or piercings?",
            "What's your favorite type of flower?",
            "Do you have a favorite historical period?",
            "What's your favorite childhood game?",
            "What's your favorite type of car?"
        ]
      },
      "Level 2": {
        "Questions": [
            "What is the most valuable lesson you've learned from a past relationship?",
            "How do you define success, and do you feel successful at this point in your life?",
            "What is your biggest fear, and how has it impacted your life?",
            "What is your favorite childhood memory, and why does it stand out to you?",
            "Have you ever experienced a significant turning point in your life? If so, what was it and how did it change you?",
            "What do you believe is the key to maintaining a strong and enduring friendship?",
            "What are the top three qualities you value in a romantic partner?",
            "What is the most challenging decision you've ever had to make, and how did it impact your life?",
            "If you could change one thing about yourself, what would it be and why?",
            "How do you handle stress and difficult situations in your life?",
            "What is the greatest accomplishment you've achieved so far, and how did you achieve it?",
            "How do you view the role of honesty and trust in a relationship?",
            "What is the one thing you wish you could say to someone but haven't had the courage to?",
            "What motivates you to get out of bed every morning?",
            "What is your biggest regret, and what have you learned from it?",
            "How do you handle disagreements or conflicts with people close to you?",
            "What is the most challenging obstacle you've faced in pursuing your dreams?",
            "What is your proudest moment, and why does it mean so much to you?",
            "What do you think is the biggest misconception people have about you?",
            "What role do you think vulnerability plays in building strong relationships?",
            "What values do you hold most dear, and how do they guide your decisions and actions?",
            "What is your greatest source of inspiration in life?",
            "How do you define happiness, and what brings you the most joy in life?",
            "What is the most important life lesson you want to pass on to others?",
            "What do you consider the most significant turning point in your career?",
            "How do you balance your personal and professional life, and what challenges have you faced in doing so?",
            "What is your biggest source of motivation during tough times?",
            "What are the top three values you look for in a close friend?",
            "What do you think is the key to maintaining a healthy work-life balance?",
            "What are your thoughts on the meaning and purpose of life?",
            "How do you handle failure, and what have you learned from your failures?",
            "What do you believe is the most important quality for a successful team or partnership?",
            "What is the most significant sacrifice you've made for someone else, and do you regret it?",
            "How do you think your upbringing has shaped who you are today?",
            "What is the most valuable piece of advice you've received, and how has it impacted your life?",
            "What do you think is the biggest challenge people face in understanding and accepting themselves?",
            "What do you consider the most significant milestone in your personal growth journey?",
            "How do you handle change and adapt to new situations in your life?",
            "What do you think is the most important quality in a leader?",
            "What is the most significant goal you want to accomplish in the next five years?",
            "How do you think your cultural background has influenced your perspective on life?",
            "What do you think is the most important factor in maintaining a healthy and loving family?",
            "What do you believe is the most important lesson to teach future generations?",
            "How do you think your friends perceive you, and does it align with how you perceive yourself?",
            "What do you think is the key to building a strong and fulfilling career?",
            "What is the biggest obstacle you've faced in understanding and accepting yourself?",
            "How do you think your past experiences have influenced your approach to new relationships?",
            "What do you think is the most significant challenge in maintaining long-term friendships?",
            "How do you think your past relationships have shaped your expectations for future relationships?",
            "What do you believe is the key to finding meaning and purpose in life?"
        ]
      },
      "Level 3": {
        "Questions": [
            "What do you think is my most cherished childhood memory?",
            "How do you think our lives would be different if we had met earlier or later?",
            "What is something you admire or respect about me that you've never told me before?",
            "Do you think I have any habits or traits that hold me back?",
            "If you could change one decision I've made in the past, what would it be and why?",
            "What do you think are my top three strengths and my top three weaknesses?",
            "What's something you've always wanted to tell me but never have?",
            "How do you think I've grown or changed in the last few years?",
            "What do you think are the biggest challenges I will face in the future?",
            "What is something you wish I knew about you but have never told me?",
            "How do you think I handle stress or difficult situations?",
            "What's something about me that you think most people misunderstand?",
            "What is a goal of mine that you think I might not be aware of?",
            "If you could describe me in three words, what would they be and why?",
            "What do you think is my biggest fear and why?",
            "How do you think I've impacted the people around me, including you?",
            "What's something you've learned from me that you think has helped you in your life?",
            "If you could give me one piece of advice for my future, what would it be?",
            "What's something about me that you think most people admire?",
            "What is one thing you would like to see me accomplish in the next year?",
            "How do you think our friendship has influenced who we are as individuals?",
            "What's a story about myself that you think best represents who I am?",
            "If you could change one thing about the way I communicate, what would it be and why?",
            "What is one thing you think I should do more of in my life?",
            "How do you think I've handled failure or disappointment in the past?",
            "What do you think is my greatest accomplishment and why?",
            "If you had to pick a fictional character that reminds you of me, who would it be and why?",
            "What's something you wish I would talk about more often with you?",
            "How do you think my upbringing has shaped who I am today?",
            "What is one thing you think I need to let go of in order to move forward in my life?",
            "If you could change one thing about my life, what would it be and why?",
            "What's something you think I should be more proud of in my life?",
            "How do you think I come across to new people when they first meet me?",
            "What do you think is my biggest regret and why?",
            "If you had to choose a song that represents our friendship, what would it be and why?",
            "What's something you think I should be more forgiving of in my life?",
            "How do you think I've handled success or achievement in the past?",
            "What is one thing you think I should prioritize more in my life?",
            "If you could change one thing about the way I approach relationships, what would it be and why?",
            "What's something you think I should be more confident about in my life?",
            "How do you think my values and beliefs have evolved over time?",
            "What do you think is my greatest unfulfilled desire and why?",
            "If you had to choose a movie that represents our friendship, what would it be and why?",
            "What's something you think I should be more patient about in my life?",
            "How do you think I've handled changes and transitions in my life?",
            "What is one thing you think I should pay more attention to in my life?",
            "If you could change one thing about the way I handle conflicts, what would it be and why?",
            "What's something you think I should be more grateful for in my life?"
        ]
      }
    }
  }
  